controllers/HomeController.php

SELECT * FROM `product` WHERE `is_offer`=1 LIMIT 4
---
    public function actionIndex()
    {
        $offers = Product::find()->where(['is_offer' => 1])->limit(4)->all();