components/MenuWidget.php

    public function run()
    {

        //get cache
        $menu = \Yii::$app->cache->get('menu');
        if($menu){
            return $menu;
        }

        $this->data = Category::find()->select('id, parent_id, title')->indexBy('id')->asArray()->all();
---
SELECT `id`, `parent_id`, `title` FROM `category`